export const ErrorMessage = {
	1001: '깃허브에서 통신중 에러가 발생하였습니다.',
	1002: '깃허브에서 사용자 정보를 불러오는 데 에러가 발생하였습니다.',
	1003: '로그인이 되었는지 다시 확인해주세요.',
	1004: '다시 로그인을 해주세요.',
	1005: '다시 로그인을 해주세요.',
	1006: '인증을 하는 도중 에러가 발생하였습니다.',
	1007: '권한이 존재하지 않습니다.',

	2001: '존재하지 않는 회원입니다.',

	3001: '존재하지 않는 게시물입니다.',
	3002: '게시글 제목은 500자 이하로 입력해주세요.',
	3003: '게시물 제목은 1자 이상으로 입력해주세요.',
	3004: '게시물 내용은 10000자 이하로 입력해주세요.',
	3005: '존재하지 않는 카테고리입니다.',

	4001: '해당 댓글이 존재하지 않습니다.',
	4002: '댓글은 1자 이상으로 입력해주세요.',
	4003: '댓글은 10000자 이하로 입력해주세요.',

	5001: '유효하지 않은 투표 만료일입니다.',
	5002: '투표 항목내용은 비어있을수 없습니다.',
	5003: '투표 항목내용은 500자 이하로 입력해주세요.',
	5004: '투표가 존재하지 않습니다.',
	5005: '투표는 토론을 통해서 작성해주세요.',
	5006: '투표수는 0이상 이여야합니다.',
	5007: '투표 항목이 존재하지 않습니다.',
	5008: '투표 내역이 존재하지 않습니다.',
	5009: '이미 투표한 항목입니다.',
};
